app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
	headers = ["title","release_date"]
	if params[:order_by].eql? "title" or params[:order_by].eql? "release_date"
		@movies = Movie.order("#{params[:order_by]} ASC")